# Quantity Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationAncillaryUsage..::..Quantity Property
FabricationAncillaryUsage Class See Also
---
Quantity of required ancillaries.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017 Subscription Update
# Syntax
C#
---
```text
public double Quantity { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Quantity As Double
	Get
```

Visual C++
---
```text
public:
property double Quantity {
	double get ();
}
```

# See Also
FabricationAncillaryUsage Class
Autodesk.Revit.DB Namespace